{
  "fetched_at": "2026-02-27T00:59:55.690171Z",
  "articles": [
    {
      "title": "The key qualities a driver needs in a race engineer",
      "summary": "The key qualities a driver needs in a race engineer. We asked F1 TV analyst and IndyCar race winner James Hinchcliffe what exactly makes that relationship work, and the key traits a driver looks for in their ideal race engineer.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/hinchcliffe-what-are-the-key-qualities-a-driver-is-looking-for-in-a-race.2CZXY1g5VnQocieshctaui"
    },
    {
      "title": "Mario Isola to leave Head of Motorsport role at Pirelli",
      "summary": "Mario Isola to leave Head of Motorsport role at Pirelli. Pirelli have announced that Mario Isola will leave his role as Head of Motorsport at Pirelli, with Dario Marrafuschi confirmed as the Italian’s replacement.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/mario-isola-to-leave-head-of-motorsport-role-at-pirelli-as-dario-marrafuschi.RVHl3VmCtalinpSsLMtKq"
    },
    {
      "title": "Perez and Albon offer Hadjar advice on second Red Bull seat",
      "summary": "Perez and Albon offer Hadjar advice on second Red Bull seat. Former Red Bull drivers Sergio Perez and Alex Albon have given advice to Isack Hadjar as he prepares to step into the second Red Bull seat, encouraging him to make the most of the “massive opportunity”.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/a-massive-opportunity-perez-and-albon-offer-hadjar-advice-on-second-red-bull.7mgsPWIMkSN8JL1dDlqjJh"
    },
    {
      "title": "Who are the reserve drivers for each F1 team in 2026?",
      "summary": "Who are the reserve drivers for each F1 team in 2026?. Teams need to be prepared to adapt to every scenario, including the possibility that one of their main drivers could fall ill or sustain an injury that rules them out of a race weekend. With every result proving crucial, their roster of reserve ...",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/who-are-the-reserve-drivers-for-each-f1-team-in-2026.Ce8YvwuVJGLkVNgERX21U"
    },
    {
      "title": "What do the new lights on F1 cars mean?",
      "summary": "What do the new lights on F1 cars mean?. Everyone’s been talking about the raft of technical innovations and changes for 2026, but one of the easiest for fans to spot is the new rear and side lights on each car. You’ll see them flashing at every circuit, but what exactly does each colour and sequenc...",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/explained-what-do-the-new-lights-on-f1-cars-mean.2W9KyVqIpHgZAvKqJXxAEM"
    },
    {
      "title": "The Audi prospect making waves in single-seater racing",
      "summary": "The Audi prospect making waves in single-seater racing. Freddie Slater, the first driver signed to Audi's junior programme, chats about his rapid rise to F3, his goal to make it into F1 and his friendship with current World Champion Lando Norris.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/exclusive-f3-prospect-slater-on-his-rapid-rise-joining-audi-and-his.35b9VMuePDwQ4c8sEGykYH"
    },
    {
      "title": "F1 welcomes Damson Idris as Global Brand Ambassador",
      "summary": "F1 welcomes Damson Idris as Global Brand Ambassador. Following the launch of F1’s ‘All To Drive For’ campaign, featuring acclaimed actor Damson Idris, the Hollywood star is officially joining the F1 family as a Global Brand Ambassador.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/formula-1-welcomes-damson-idris-as-global-brand-ambassador.6HppgABYlr6pPuHS6muMQ8"
    },
    {
      "title": "Albon admits Williams are ‘not where we want to be’",
      "summary": "Albon admits Williams are ‘not where we want to be’. Alex Albon conceded that Williams are on the back foot ahead of the season opener in Australia.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/were-not-where-we-want-to-be-albon-assesses-williams-position-after-bahrain.2995kgds0w7dwHdOFcBhdh"
    },
    {
      "title": "Alpine performance is ‘tricky to tell’ – Colapinto",
      "summary": "Alpine performance is ‘tricky to tell’ – Colapinto. Franco Colapinto has admitted that despite early signs of promise, it’s “tricky to tell” how competitive Alpine will be compared to their midfield rivals as they target a significant improvement from last season.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/colapinto-concedes-alpine-performance-is-tricky-to-tell-despite-very-helpful.234V15Ry9tQfN2H8Gszawb"
    },
    {
      "title": "F1 betting talking points ahead of 2026 season",
      "summary": "F1 betting talking points ahead of 2026 season. Our betting experts answer the key F1 talking points ahead of the Australian Grand Prix, including which drivers and teams they're backing this season.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/f1-betting-talking-points-our-writers-give-their-hot-tips-and-predictions.6sJozPD381agxxSwqlV1fb"
    },
    {
      "title": "Max Verstappen looks ahead to the 2026 F1 season with Apple Music's Ebro Darden",
      "summary": "Max Verstappen looks ahead to the 2026 F1 season with Apple Music's Ebro Darden. Ahead of the new Formula 1 season, starting next weekend with the Australian Grand Prix in Melbourne, Red Bull Racing's Max Verstappen sits down with Apple Music’s Ebro Darden to discuss how he has prepared for the seas...",
      "source": "Racer.com",
      "published_at": "Thu, 26 Feb 2026 19:29:22 GMT",
      "url": "https://racer.com/2026/02/26/max-verstappen-looks-ahead-to-the-2026-f1-season-with-apple-music-s-ebro-darden"
    },
    {
      "title": "Netflix set to show Canadian GP as Apple TV carries Drive to Survive",
      "summary": "Netflix set to show Canadian GP as Apple TV carries Drive to Survive. Netflix will broadcast this year’s Canadian Grand Prix as a result of a partnership that will also include Apple TV carrying the latest season of the streaming giant's Formula 1 docuseries.",
      "source": "Racer.com",
      "published_at": "Thu, 26 Feb 2026 16:25:26 GMT",
      "url": "https://racer.com/2026/02/26/netflix-set-to-show-canadian-gp-as-apple-tv-carries-drive-to-survive"
    },
    {
      "title": "Motorsport boss Isola to leave Pirelli",
      "summary": "Motorsport boss Isola to leave Pirelli. Pirelli’s head of motorsport Mario Isola will leave the tire manufacturer in July, handing over duties to Dario Marrafuschi.",
      "source": "Racer.com",
      "published_at": "Thu, 26 Feb 2026 12:58:57 GMT",
      "url": "https://racer.com/2026/02/26/motorsport-boss-isola-to-leave-pirelli"
    },
    {
      "title": "The RACER Mailbag, February 25",
      "summary": "The RACER Mailbag, February 25. Gimmicks vs interesting challenges and why competing chassis is unlikely to be a thing anymore in IndyCar among topics in the RACER Mailbag this week.",
      "source": "Racer.com",
      "published_at": "Wed, 25 Feb 2026 10:00:00 GMT",
      "url": "https://racer.com/2026/02/24/the-racer-mailbag-february-25"
    },
    {
      "title": "Horner believes Mintzlaff, Marko responsible for his Red Bull exit, not Verstappen",
      "summary": "Horner believes Mintzlaff, Marko responsible for his Red Bull exit, not Verstappen. Christian Horner believes his Red Bull exit last year was down to Oliver Mintzlaff and Helmut Marko, despite tensions with Max Verstappen’s father Jos.",
      "source": "Racer.com",
      "published_at": "Wed, 25 Feb 2026 09:59:17 GMT",
      "url": "https://racer.com/2026/02/25/horner-believes-mintzlaff-marko-responsible-for-his-red-bull-exit-not-verstappen"
    },
    {
      "title": "F1 still ‘the ultimate challenge’ for a driver - Stella",
      "summary": "F1 still ‘the ultimate challenge’ for a driver - Stella. Despite criticisms of Formula 1's new regulations, McLaren team principal Andrea Stella still believes it's too early to write them off.",
      "source": "Racer.com",
      "published_at": "Tue, 24 Feb 2026 17:09:06 GMT",
      "url": "https://racer.com/2026/02/24/f1-still-the-ultimate-challenge-for-a-driver---stella"
    },
    {
      "title": "Cadillac radiating positivity after F1 pre-season testing",
      "summary": "Cadillac radiating positivity after F1 pre-season testing. There's an upbeat mood at Formula 1's newest team following a solid pre-season run.",
      "source": "Racer.com",
      "published_at": "Tue, 24 Feb 2026 16:50:52 GMT",
      "url": "https://racer.com/2026/02/24/cadillac-radiating-positivity-after-pre-season-testing"
    },
    {
      "title": "Why Cadillac has already earned the respect of its rivals",
      "summary": "Why Cadillac has already earned the respect of its rivals. Amid the mystery, uncertainty, and politics of Formula 1 pre-season testing, there was one unanimous conclusion in the paddock: Cadillac has done an outstanding job. Characterized by quiet admiration and remarks about a job well done, rather...",
      "source": "Racer.com",
      "published_at": "Mon, 23 Feb 2026 16:09:06 GMT",
      "url": "https://racer.com/2026/02/23/why-cadillac-has-already-earned-the-respect-of-its-rivals"
    },
    {
      "title": "Apple reach ‘will be even bigger in the future’ than ESPN - Domenicali",
      "summary": "Apple reach ‘will be even bigger in the future’ than ESPN - Domenicali. F1 CEO Stefano Domenicali believes Apple can have a greater reach than ESPN did as F1's U.S. broadcaster.",
      "source": "Racer.com",
      "published_at": "Mon, 23 Feb 2026 13:01:35 GMT",
      "url": "https://racer.com/2026/02/23/apple-s-f1-broadcast-reach-will-be-bigger-than-espn-s---domenicali"
    },
    {
      "title": "Russell thinks Mercedes needs work to make it four-team fight at the front in Australia",
      "summary": "Russell thinks Mercedes needs work to make it four-team fight at the front in Australia. \"We have looked in the mix with several of our rivals near the front but it's clear, with Ferrari topping the times and McLaren and Red Bull Racing being right on their tails, that we need to continue working ha...",
      "source": "Racer.com",
      "published_at": "Fri, 20 Feb 2026 18:48:07 GMT",
      "url": "https://racer.com/2026/02/20/russell-thinks-mercedes-needs-work-to-make-it-four-team-fight-at-the-front-in-australia"
    },
    {
      "title": "Will drivers still make a difference in F1 in 2026?",
      "summary": "Will drivers still make a difference in F1 in 2026?. Have F1's new rules damaged its status as the ultimate challenge? Andrew Benson assesses what the drivers are having to do differently and whether skill still matters.",
      "source": "F1 News",
      "published_at": "Thu, 26 Feb 2026 06:43:56 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cp3271z2859o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "The 'rare combination' behind Britain's youngest F1 driver",
      "summary": "The 'rare combination' behind Britain's youngest F1 driver. Arvid Lindblad tells BBC Sport about being shaped by his Indian and Swedish heritage and how he was fixated on reaching F1 from aged five.",
      "source": "F1 News",
      "published_at": "Wed, 25 Feb 2026 06:43:34 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c1kgz78klv9o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Verstappen was not behind my Red Bull exit - Horner",
      "summary": "Verstappen was not behind my Red Bull exit - Horner. Christian Horner says Max Verstappen and his camp were \"not responsible\" for his exit from Red Bull in 2025.",
      "source": "F1 News",
      "published_at": "Tue, 24 Feb 2026 22:42:20 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c8r1y61vxevo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Why has it gone so wrong for Aston Martin?",
      "summary": "Why has it gone so wrong for Aston Martin?. The combination of Adrian Newey, Honda and Fernando Alonso was highly promising but Aston Martin are in trouble. Andrew Benson explains why.",
      "source": "F1 News",
      "published_at": "Tue, 24 Feb 2026 06:39:49 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cr45w421yg4o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Andrew Benson Q&A: Send us your questions",
      "summary": "Andrew Benson Q&A: Send us your questions. Our F1 correspondent Andrew Benson is doing a weekly Q&amp;A this season, so get your questions in now.",
      "source": "F1 News",
      "published_at": "Tue, 24 Feb 2026 07:41:23 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/ckg3y15zje8o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Who are the winners and losers from F1 pre-season testing?",
      "summary": "Who are the winners and losers from F1 pre-season testing?. As pre-season testing reaches its conclusion, which teams look best - and worst - placed ahead of the Australian Grand Prix?",
      "source": "F1 News",
      "published_at": "Fri, 20 Feb 2026 19:44:29 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c77e1djpg3mo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "'Keep calm,' says Domenicali on criticism of new F1 rules",
      "summary": "'Keep calm,' says Domenicali on criticism of new F1 rules. Formula 1 boss Stefano Domenicali calls for calm in the face of criticism from drivers of the sport's new rules - but said changes would be made if necessary.",
      "source": "F1 News",
      "published_at": "Fri, 20 Feb 2026 00:00:08 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cn870nk9eveo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Norris admits new F1 cars 'not purest form of racing'",
      "summary": "Norris admits new F1 cars 'not purest form of racing'. Lando Norris admits he described the new Formula 1 cars as \"a lot of fun\" last week to \"see what the reaction was of everyone\".",
      "source": "F1 News",
      "published_at": "Thu, 19 Feb 2026 14:17:19 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c7vjnyzj0e7o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "'There is a small Geordie enclave in the F1 paddock'",
      "summary": "'There is a small Geordie enclave in the F1 paddock'. Graeme Lowdon is the team principal for Cadillac, the newcomers to 2026's F1 season.",
      "source": "F1 News",
      "published_at": "Sat, 21 Feb 2026 11:47:30 GMT",
      "url": "https://www.bbc.com/news/articles/cly0r054ekpo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Hamilton finds new F1 cars 'more fun' to drive",
      "summary": "Hamilton finds new F1 cars 'more fun' to drive. Lewis Hamilton says he finds the new Formula 1 cars this year \"more fun\" to drive - in contrast to the views of Max Verstappen and Fernando Alonso.",
      "source": "F1 News",
      "published_at": "Wed, 18 Feb 2026 16:09:06 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c20z9wlw1vpo?at_medium=RSS&at_campaign=rss"
    }
  ]
}