{
  "fetched_at": "2026-03-01T01:07:19.026760Z",
  "articles": [
    {
      "title": "How Drive to Survive changed fandom and racing culture",
      "summary": "How Drive to Survive changed fandom and racing culture. Ever since its debut in 2019, Drive to Survive has captivated audiences from across the world – here’s how it has changed F1 fandom and culture.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/how-drive-to-survive-has-changed-f1-fandom-and-racing-culture.2sIawNwTgDiKRGGe9TZ3N9"
    },
    {
      "title": "Who is in the mix for best of the rest in 2026?",
      "summary": "Who is in the mix for best of the rest in 2026?. F1.com's Lawrence Barretto runs through the candidates for which team could emerge as the leader of the midfield entering into 2026.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/which-teams-are-in-the-mix-to-be-best-of-the-rest-in-2026.6r5KT4RW3eqQLYwl24MBEO"
    },
    {
      "title": "Drive to Survive’s producers on how Season 8 came together",
      "summary": "Drive to Survive’s producers on how Season 8 came together. A new F1 season means another helping of Drive to Survive, with the popular Netflix series returning to screens and retelling the story of a spectacular 2025 campaign – headlined by the three-way fight for the World Championship between McL...",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/exclusive-theres-something-for-everyone-drive-to-survives-producers-share.2vb1OLD5h6sQAlVkNgtcoc"
    },
    {
      "title": "Our writers share their predictions for the 2026 season",
      "summary": "Our writers share their predictions for the 2026 season. Ahead of the 2026 F1 season getting underway, our writers have given their take on how the campaign might unfold.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/from-title-contenders-to-the-biggest-surprises-our-writers-share-their.vNsbt0HdIfRibnLf7UkAG"
    },
    {
      "title": "Why F1 betting markets can be hard to predict",
      "summary": "Why F1 betting markets can be hard to predict. F1 betting can be extremely hard to predict, so we've taken a look at the different aspects that racing fans should keep an eye out for in the markets.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/why-formula-1-races-are-hard-to-predict-and-what-bettors-need-to-watch-out.56mBS7HSotT2Xt4sirtPLc"
    },
    {
      "title": "Button tips Hamilton to be 'back to his best' in 2026",
      "summary": "Button tips Hamilton to be 'back to his best' in 2026. After a tough debut year at Ferrari, Jenson Button is expecting his former team mate to shine this season.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/button-tips-former-team-mate-hamilton-to-be-back-to-his-best-under-new-f1.14wrFhap8A0sturSpz2BSn"
    },
    {
      "title": "How to take a break from gambling when you need it",
      "summary": "How to take a break from gambling when you need it. If you feel like you need to take a break from betting, here are some useful tips to help you stop gambling.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/how-to-take-a-break-from-gambling-when-you-need-it.68FuYEwZd5hZAtcQZZlSdz"
    },
    {
      "title": "The incredible numbers behind Season 8 of Drive to Survive",
      "summary": "The incredible numbers behind Season 8 of Drive to Survive. Another eagerly anticipated season of Drive to Survive has arrived on Netflix ahead of the 2026 F1 campaign. But how much do you know about what’s involved in the filming, production and editing process? With help from Box To Box, who produ...",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/in-numbers-the-incredible-figures-behind-season-8-of-drive-to-survive.G3lrcwjsQWk9ISGaAU0oV"
    },
    {
      "title": "5 standout moments in Season 8 of Drive to Survive",
      "summary": "5 standout moments in Season 8 of Drive to Survive. After the Barcelona Shakedown and two weeks of pre-season testing in Bahrain, it’s almost time to kick off F1’s new era with the Australian Grand Prix – but before that, Drive to Survive returns to our screens on Netflix for one last look at 2025. ...",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/from-doohans-demotion-to-a-las-vegas-team-boss-special-5-standout-moments-in.1mO7XZr0t8bsGj1p5tVvbQ"
    },
    {
      "title": "Watch the ultimate guide to the 2026 cars",
      "summary": "Watch the ultimate guide to the 2026 cars. It's all to play for in 2026 as an overhaul of the regulations is set to shake up the competitive order, with slimmed down cars and technical innovations at the forefront of the changes.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/watch-the-ultimate-guide-to-the-2026-cars.1xcg2ITfiXBOjrR4QGmuer"
    },
    {
      "title": "Cadillac names first F1 chassis after Mario Andretti",
      "summary": "Cadillac names first F1 chassis after Mario Andretti. Although the team has since evolved and dropped the Andretti name from its title, ahead of Cadillac’s debut race it has confirmed its chassis will be the MAC-26 – or the Mario Andretti Cadillac 26.",
      "source": "Racer.com",
      "published_at": "Fri, 27 Feb 2026 16:56:54 GMT",
      "url": "https://racer.com/2026/02/27/cadillac-names-first-f1-chassis-after-mario-andretti"
    },
    {
      "title": "Max Verstappen looks ahead to the 2026 F1 season with Apple Music's Ebro Darden",
      "summary": "Max Verstappen looks ahead to the 2026 F1 season with Apple Music's Ebro Darden. Ahead of the new Formula 1 season, starting next weekend with the Australian Grand Prix in Melbourne, Red Bull Racing's Max Verstappen sits down with Apple Music’s Ebro Darden to discuss how he has prepared for the seas...",
      "source": "Racer.com",
      "published_at": "Thu, 26 Feb 2026 19:29:22 GMT",
      "url": "https://racer.com/2026/02/26/max-verstappen-looks-ahead-to-the-2026-f1-season-with-apple-music-s-ebro-darden"
    },
    {
      "title": "Netflix set to show Canadian GP as Apple TV carries Drive to Survive",
      "summary": "Netflix set to show Canadian GP as Apple TV carries Drive to Survive. Netflix will broadcast this year’s Canadian Grand Prix as a result of a partnership that will also include Apple TV carrying the latest season of the streaming giant's Formula 1 docuseries.",
      "source": "Racer.com",
      "published_at": "Thu, 26 Feb 2026 16:25:26 GMT",
      "url": "https://racer.com/2026/02/26/netflix-set-to-show-canadian-gp-as-apple-tv-carries-drive-to-survive"
    },
    {
      "title": "Motorsport boss Isola to leave Pirelli",
      "summary": "Motorsport boss Isola to leave Pirelli. Pirelli’s head of motorsport Mario Isola will leave the tire manufacturer in July, handing over duties to Dario Marrafuschi.",
      "source": "Racer.com",
      "published_at": "Thu, 26 Feb 2026 12:58:57 GMT",
      "url": "https://racer.com/2026/02/26/motorsport-boss-isola-to-leave-pirelli"
    },
    {
      "title": "The RACER Mailbag, February 25",
      "summary": "The RACER Mailbag, February 25. Gimmicks vs interesting challenges and why competing chassis is unlikely to be a thing anymore in IndyCar among topics in the RACER Mailbag this week.",
      "source": "Racer.com",
      "published_at": "Wed, 25 Feb 2026 10:00:00 GMT",
      "url": "https://racer.com/2026/02/24/the-racer-mailbag-february-25"
    },
    {
      "title": "Horner believes Mintzlaff, Marko responsible for his Red Bull exit, not Verstappen",
      "summary": "Horner believes Mintzlaff, Marko responsible for his Red Bull exit, not Verstappen. Christian Horner believes his Red Bull exit last year was down to Oliver Mintzlaff and Helmut Marko, despite tensions with Max Verstappen’s father Jos.",
      "source": "Racer.com",
      "published_at": "Wed, 25 Feb 2026 09:59:17 GMT",
      "url": "https://racer.com/2026/02/25/horner-believes-mintzlaff-marko-responsible-for-his-red-bull-exit-not-verstappen"
    },
    {
      "title": "F1 still ‘the ultimate challenge’ for a driver - Stella",
      "summary": "F1 still ‘the ultimate challenge’ for a driver - Stella. Despite criticisms of Formula 1's new regulations, McLaren team principal Andrea Stella still believes it's too early to write them off.",
      "source": "Racer.com",
      "published_at": "Tue, 24 Feb 2026 17:09:06 GMT",
      "url": "https://racer.com/2026/02/24/f1-still-the-ultimate-challenge-for-a-driver---stella"
    },
    {
      "title": "Cadillac radiating positivity after F1 pre-season testing",
      "summary": "Cadillac radiating positivity after F1 pre-season testing. There's an upbeat mood at Formula 1's newest team following a solid pre-season run.",
      "source": "Racer.com",
      "published_at": "Tue, 24 Feb 2026 16:50:52 GMT",
      "url": "https://racer.com/2026/02/24/cadillac-radiating-positivity-after-pre-season-testing"
    },
    {
      "title": "Why Cadillac has already earned the respect of its rivals",
      "summary": "Why Cadillac has already earned the respect of its rivals. Amid the mystery, uncertainty, and politics of Formula 1 pre-season testing, there was one unanimous conclusion in the paddock: Cadillac has done an outstanding job. Characterized by quiet admiration and remarks about a job well done, rather...",
      "source": "Racer.com",
      "published_at": "Mon, 23 Feb 2026 16:09:06 GMT",
      "url": "https://racer.com/2026/02/23/why-cadillac-has-already-earned-the-respect-of-its-rivals"
    },
    {
      "title": "Apple reach ‘will be even bigger in the future’ than ESPN - Domenicali",
      "summary": "Apple reach ‘will be even bigger in the future’ than ESPN - Domenicali. F1 CEO Stefano Domenicali believes Apple can have a greater reach than ESPN did as F1's U.S. broadcaster.",
      "source": "Racer.com",
      "published_at": "Mon, 23 Feb 2026 13:01:35 GMT",
      "url": "https://racer.com/2026/02/23/apple-s-f1-broadcast-reach-will-be-bigger-than-espn-s---domenicali"
    },
    {
      "title": "F1 to revise engine rule at centre of row",
      "summary": "F1 to revise engine rule at centre of row. Mercedes' rivals succeed in securing a rule change following a pre-season technical row over engine performance.",
      "source": "F1 News",
      "published_at": "Sat, 28 Feb 2026 10:49:17 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cq8g3lqqdvgo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Cadillac and Audi - the same ambition but two very different projects",
      "summary": "Cadillac and Audi - the same ambition but two very different projects. Cadillac and Audi enter F1 with the ultimate goal of becoming world champions. Both know they have some way to go before achieving that aim.",
      "source": "F1 News",
      "published_at": "Fri, 27 Feb 2026 06:42:21 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c4gjmkj4g88o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Formula 1's new golden age of celebrity may have just begun",
      "summary": "Formula 1's new golden age of celebrity may have just begun. As the eighth series of Netflix's hugely popular Drive To Survive is released this weekend, has Formula 1 become one big star playground?",
      "source": "F1 News",
      "published_at": "Sat, 28 Feb 2026 00:01:44 GMT",
      "url": "https://www.bbc.com/news/articles/cp8rz13gdx0o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Which tyres will be used in F1 in 2026?",
      "summary": "Which tyres will be used in F1 in 2026?. Our Ask Me Anything team explain the different types of tyres used in Formula 1.",
      "source": "F1 News",
      "published_at": "Sat, 28 Feb 2026 07:23:26 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cly9l13qq8po?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Will drivers still make a difference in F1 in 2026?",
      "summary": "Will drivers still make a difference in F1 in 2026?. Have F1's new rules damaged its status as the ultimate challenge? Andrew Benson assesses what the drivers are having to do differently and whether skill still matters.",
      "source": "F1 News",
      "published_at": "Thu, 26 Feb 2026 06:43:56 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cp3271z2859o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "The 'rare combination' behind Britain's youngest F1 driver",
      "summary": "The 'rare combination' behind Britain's youngest F1 driver. Arvid Lindblad tells BBC Sport about being shaped by his Indian and Swedish heritage and how he was fixated on reaching F1 from aged five.",
      "source": "F1 News",
      "published_at": "Wed, 25 Feb 2026 06:43:34 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c1kgz78klv9o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Verstappen was not behind my Red Bull exit - Horner",
      "summary": "Verstappen was not behind my Red Bull exit - Horner. Christian Horner says Max Verstappen and his camp were \"not responsible\" for his exit from Red Bull in 2025.",
      "source": "F1 News",
      "published_at": "Tue, 24 Feb 2026 22:42:20 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c8r1y61vxevo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Why has it gone so wrong for Aston Martin?",
      "summary": "Why has it gone so wrong for Aston Martin?. The combination of Adrian Newey, Honda and Fernando Alonso was highly promising but Aston Martin are in trouble. Andrew Benson explains why.",
      "source": "F1 News",
      "published_at": "Tue, 24 Feb 2026 06:39:49 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cr45w421yg4o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Andrew Benson Q&A: Send us your questions",
      "summary": "Andrew Benson Q&A: Send us your questions. Our F1 correspondent Andrew Benson is doing a weekly Q&amp;A this season, so get your questions in now.",
      "source": "F1 News",
      "published_at": "Tue, 24 Feb 2026 07:41:23 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/ckg3y15zje8o?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Who are the winners and losers from F1 pre-season testing?",
      "summary": "Who are the winners and losers from F1 pre-season testing?. As pre-season testing reaches its conclusion, which teams look best - and worst - placed ahead of the Australian Grand Prix?",
      "source": "F1 News",
      "published_at": "Fri, 20 Feb 2026 19:44:29 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c77e1djpg3mo?at_medium=RSS&at_campaign=rss"
    }
  ]
}