{
  "fetched_at": "2026-02-23T03:43:28.662417Z",
  "articles": [
    {
      "title": "F1 is back – and it’s all to drive for",
      "summary": "F1 is back – and it’s all to drive for. New cars. New power. New teams. Get excited as Formula 1 roars into life for the 2026 season and an all-new era of competition.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/watch-f1-is-back-and-its-all-to-drive-for.6c31jsUNe7uVnJdILzD76Q"
    },
    {
      "title": "See Tsunoda back in a Red Bull at special San Francisco demo",
      "summary": "See Tsunoda back in a Red Bull at special San Francisco demo. Check out the best images as Red Bull Reserve and Test Driver Yuki Tsunoda wows the crowds in San Francisco demo.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/gallery-tsunoda-back-in-a-red-bull-at-special-san-francisco-demo.6l1LvnrXQedrIOr1Lx4gRm"
    },
    {
      "title": "5 Winners and 3 Losers from the second Bahrain test",
      "summary": "5 Winners and 3 Losers from the second Bahrain test. F1.com's Lawrence Barretto picks out his winners and losers from the final 2026 pre-season test in Bahrain.",
      "source": "F1 News",
      "published_at": "",
      "url": "https://www.formula1.com/en/latest/article/5-winners-and-3-losers-from-the-second-pre-season-test-in-bahrain-who-goes.1k8rkc8JVjh0vjS1jrGEnd"
    },
    {
      "title": "Russell thinks Mercedes needs work to make it four-team fight at the front in Australia",
      "summary": "Russell thinks Mercedes needs work to make it four-team fight at the front in Australia. \"We have looked in the mix with several of our rivals near the front but it's clear, with Ferrari topping the times and McLaren and Red Bull Racing being right on their tails, that we need to continue working ha...",
      "source": "Racer.com",
      "published_at": "Fri, 20 Feb 2026 18:48:07 GMT",
      "url": "https://racer.com/2026/02/20/russell-thinks-mercedes-needs-work-to-make-it-four-team-fight-at-the-front-in-australia"
    },
    {
      "title": "Leclerc brings Ferrari to the fore as Bahrain F1 test concludes",
      "summary": "Leclerc brings Ferrari to the fore as Bahrain F1 test concludes. Charles Leclerc produced the fastest time of pre-season testing and took Ferrari nearly a second clear of the field on the final day in Bahrain.",
      "source": "Racer.com",
      "published_at": "Fri, 20 Feb 2026 17:35:52 GMT",
      "url": "https://racer.com/2026/02/20/leclerc-brings-ferrari-to-the-fore-as-bahrain-f1-test-concludes"
    },
    {
      "title": "Honda PU problems force Aston Martin to end Bahrain test early",
      "summary": "Honda PU problems force Aston Martin to end Bahrain test early. Power unit issues for Honda limited Aston Martin to just six laps on the final day of Formula 1 pre-season testing as the team ended its track running early.",
      "source": "Racer.com",
      "published_at": "Fri, 20 Feb 2026 15:12:55 GMT",
      "url": "https://racer.com/2026/02/20/honda-pu-problems-force-aston-martin-to-end-bahrain-test-early"
    },
    {
      "title": "Who are the winners and losers from F1 pre-season testing?",
      "summary": "Who are the winners and losers from F1 pre-season testing?. As pre-season testing reaches its conclusion, which teams look best - and worst - placed ahead of the Australian Grand Prix?",
      "source": "BBC Sport",
      "published_at": "Fri, 20 Feb 2026 19:44:29 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c77e1djpg3mo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "'Keep calm,' says Domenicali on criticism of new F1 rules",
      "summary": "'Keep calm,' says Domenicali on criticism of new F1 rules. Formula 1 boss Stefano Domenicali calls for calm in the face of criticism from drivers of the sport's new rules - but said changes would be made if necessary.",
      "source": "BBC Sport",
      "published_at": "Fri, 20 Feb 2026 00:00:08 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/cn870nk9eveo?at_medium=RSS&at_campaign=rss"
    },
    {
      "title": "Norris admits new F1 cars 'not purest form of racing'",
      "summary": "Norris admits new F1 cars 'not purest form of racing'. Lando Norris admits he described the new Formula 1 cars as \"a lot of fun\" last week to \"see what the reaction was of everyone\".",
      "source": "BBC Sport",
      "published_at": "Thu, 19 Feb 2026 14:17:19 GMT",
      "url": "https://www.bbc.com/sport/formula1/articles/c7vjnyzj0e7o?at_medium=RSS&at_campaign=rss"
    }
  ]
}